
"""Написать программу, которая вычислит площадь и периметр квадрата и круга.
Сторону квадрата и радиус выберите сами)
В качестве числа pi можно использовать 3,14"""

side_square = 2
r = 15
pi = 3.14

print("Площадь квадрата равна =", side_square*side_square)
print("Периметр квадрата равен =", side_square*4)
print("Площадь круга равна =", (r**2)*pi)
print("Периметр круга равен =", (2*pi)*r)
